package ru.job4j.io;

/**
 * Напишите класс, который выводит на экран в первой строке три знака «+»,
 * во второй ― четыре знака «!», в третьей ― два знака «?».
 */
public class Task15 {
    public static void main(String[] args) {
        System.out.println("+++");
        System.out.println("!!!!");
        System.out.print("??");
    }
}
