package ru.job4j.io;

/**
 * Напишите класс, который выводит на экран последовательно три знака «+», четыре знака «!», два знака «?».
 */
public class Task16 {
    public static void main(String[] args) {
        System.out.printf("+++!!!!??");
    }
}
