package ru.job4j;

/**
 * Напишите программу, которая выводит на консоль строчку "Сегодня я молодец!"
 */
public class Praise {
    public static void main(String[] args) {
        System.out.println("Сегодня я молодец!");
    }
}
